{
  "planets": [
    {
      "name": "Mercury",
      "gltfModel": "/3d-models/mercury/scene.gltf",
      "thumbnail": "/3d-models/mercury/textures/mercurius_diffuse.png",
      "radius": 2439.7,
      "closestStar": {
        "name": "Sun",
        "proximity": 57.91
      },
      "prominentElements": [
        {
          "element": "Oxygen",
          "percentage": 42
        },
        {
          "element": "Sodium",
          "percentage": 29
        },
        {
          "element": "Hydrogen",
          "percentage": 22
        }
      ],
      "habitabilityScore": 0.1,
      "smallDescription": "The smallest and closest planet to the Sun.",
      "largeDescription": "Mercury is the first planet from the Sun and the smallest in the Solar System. In English, it is named after the ancient Roman god Mercurius (Mercury), god of commerce and communication, and the messenger of the gods. Mercury is classified as a terrestrial planet, with roughly the same surface gravity as Mars. The surface of Mercury is heavily cratered, as a result of countless impact events that have accumulated over billions of years. Its largest crater, Caloris Planitia, has a diameter of 1,550 km (960 mi), which is about one-third the diameter of the planet (4,880 km or 3,030 mi). Similarly to the Earth's Moon, Mercury's surface displays an expansive rupes system generated from thrust faults and bright ray systems formed by impact event remnants. Mercury's sidereal year (88.0 Earth days) and sidereal day (58.65 Earth days) are in a 3:2 ratio. This relationship is called spin–orbit resonance, and sidereal here means 'relative to the stars.' Consequently, one solar day (sunrise to sunrise) on Mercury lasts for around 176 Earth days: twice the planet's sidereal year. This means that one side of Mercury will remain in sunlight for one Mercurian year of 88 Earth days; while during the next orbit, that side will be in darkness all the time until the next sunrise after another 88 Earth days. Combined with its high orbital eccentricity, the planet's surface has widely varying sunlight intensity and temperature, with the equatorial regions ranging from −170 °C (−270 °F) at night to 420 °C (790 °F) during sunlight. Due to the very small axial tilt, the planet's poles are permanently shadowed. This strongly suggests that water ice could be present in the craters. Above the planet's surface is an extremely tenuous exosphere and a faint magnetic field that is strong enough to deflect solar winds. Mercury has no natural satellite. As of the early 2020s, many broad details of Mercury's geological history are still under investigation or pending data from space probes. Like other planets in the Solar System, Mercury was formed approximately 4.5 billion years ago. Its mantle is highly homogeneous, which suggests that Mercury had a magma ocean early in its history, like the Moon. According to current models, Mercury may have a solid silicate crust and mantle overlying a solid outer core, a deeper liquid core layer, and a solid inner core. There are many competing hypotheses about Mercury's origins and development, some of which incorporate collision with planetesimals and rock vaporization.",
      "orbitalSpeed": 47.87,
      "timeToOrbit": 87.97,
      "volume": 6.083E+10,
      "mass": 3.285E+23,
      "circumference": 15329.4,
      "escapeVelocity": 4.25,
      "surfaceTemperature": {
        "min": -173,
        "max": 427
      },
      "surfacePressure": 0
    },
    {
      "name": "Venus",
      "gltfModel": "/3d-models/venus/scene.gltf",
      "thumbnail": "/3d-models/venus/textures/moon_baseColor.jpeg",
      "radius": 6051.8,
      "closestStar": {
        "name": "Sun",
        "proximity": 108.2
      },
      "prominentElements": [
        {
          "element": "Carbon Dioxide",
          "percentage": 96.5
        },
        {
          "element": "Nitrogen",
          "percentage": 3.5
        },
        {
          "element": "Sulfur Dioxide",
          "percentage": 0.015
        }
      ],
      "habitabilityScore": 0.2,
      "smallDescription": "The hottest planet in our solar system.",
      "largeDescription": "Venus is the second planet from the Sun. It is a terrestrial planet and is the closest in mass and size to its orbital neighbor Earth. Venus has by far the densest atmosphere of the terrestrial planets, composed mostly of carbon dioxide with a thick, global sulfuric acid cloud cover. At the surface, it has a mean temperature of 737 K (464 °C; 867 °F) and a pressure 92 times that of Earth's at sea level. These extreme conditions compress carbon dioxide into a supercritical state at Venus's surface. Internally, Venus has a core, mantle, and crust. Venus lacks an internal dynamo, and its weakly induced magnetosphere is caused by atmospheric interactions with the solar wind. Internal heat escapes through active volcanism, resulting in resurfacing instead of plate tectonics. Venus is one of two planets in the Solar System, the other being Mercury, that have no moons. Conditions perhaps favorable for life on Venus have been identified at its cloud layers. Venus may have had liquid surface water early in its history with a habitable environment before a runaway greenhouse effect evaporated any water and turned Venus into its present state. The rotation of Venus has been slowed and turned against its orbital direction (retrograde) by the currents and drag of its atmosphere. It takes 224.7 Earth days for Venus to complete an orbit around the Sun, and a Venusian solar year is just under two Venusian days long. The orbits of Venus and Earth are the closest between any two Solar System planets, approaching each other in synodic periods of 1.6 years. Venus and Earth have the lowest difference in gravitational potential of any pair of Solar System planets. This allows Venus to be the most accessible destination and a useful gravity assist waypoint for interplanetary flights from Earth. Venus figures prominently in human culture and in the history of astronomy. Orbiting inferiorly (inside of Earth's orbit), it always appears close to the Sun in Earth's sky, as either a 'morning star' or an 'evening star.' While this is also true for Mercury, Venus appears more prominent, since it is the third brightest object in Earth's sky after the Moon and the Sun. In 1961, Venus became the target of the first interplanetary flight, Venera 1, followed by many essential interplanetary firsts, such as the first soft landing on another planet by Venera 7 in 1970. These probes demonstrated the extreme surface conditions, an insight that has informed predictions about global warming on Earth. This finding ended the theories and then popular science fiction about Venus being a habitable or inhabited planet.",
      "orbitalSpeed": 35.02,
      "timeToOrbit": 224.7,
      "volume": 9.284E+11,
      "mass": 4.867E+24,
      "circumference": 38025.7,
      "escapeVelocity": 10.36,
      "surfaceTemperature": {
        "average": 462
      },
      "surfacePressure": 9200
    },
    {
      "name": "Earth",
      "gltfModel": "/3d-models/earth/scene.gltf",
      "thumbnail": "/3d-models/earth/textures/image.png",
      "radius": 6371,
      "closestStar": {
        "name": "Sun",
        "proximity": 149.6
      },
      "prominentElements": [
        {
          "element": "Nitrogen",
          "percentage": 78
        },
        {
          "element": "Oxygen",
          "percentage": 21
        },
        {
          "element": "Argon",
          "percentage": 0.93
        }
      ],
      "habitabilityScore": 1,
      "smallDescription": "The only known planet to support life.",
      "largeDescription": "Earth is the third planet from the Sun and the only astronomical object known to harbor life. This is enabled by Earth being an ocean world, the only one in the Solar System sustaining liquid surface water. Almost all of Earth's water is contained in its global ocean, covering 70.8% of Earth's crust. The remaining 29.2% of Earth's crust is land, most of which is located in the form of continental landmasses within Earth's land hemisphere. Most of Earth's land is at least somewhat humid and covered by vegetation, while large sheets of ice at Earth's polar deserts retain more water than Earth's groundwater, lakes, rivers, and atmospheric water combined. Earth's crust consists of slowly moving tectonic plates, which interact to produce mountain ranges, volcanoes, and earthquakes. Earth has a liquid outer core that generates a magnetosphere capable of deflecting most of the destructive solar winds and cosmic radiation. Earth has a dynamic atmosphere, which sustains Earth's surface conditions and protects it from most meteoroids and UV light at entry. It has a composition of primarily nitrogen and oxygen. Water vapor is widely present in the atmosphere, forming clouds that cover most of the planet. The water vapor acts as a greenhouse gas and, together with other greenhouse gases in the atmosphere, particularly carbon dioxide (CO2), creates the conditions for both liquid surface water and water vapor to persist via the capturing of energy from the Sun's light. This process maintains the current average surface temperature of 14.76 °C (58.57 °F), at which water is liquid under normal atmospheric pressure. Differences in the amount of captured energy between geographic regions (as with the equatorial region receiving more sunlight than the polar regions) drive atmospheric and ocean currents, producing a global climate system with different climate regions and a range of weather phenomena such as precipitation, allowing components such as nitrogen to cycle. Earth is rounded into an ellipsoid with a circumference of about 40,000 km. It is the densest planet in the Solar System. Of the four rocky planets, it is the largest and most massive. Earth is about eight light-minutes away from the Sun and orbits it, taking a year (about 365.25 days) to complete one revolution. Earth rotates around its own axis in slightly less than a day (in about 23 hours and 56 minutes). Earth's axis of rotation is tilted with respect to the perpendicular to its orbital plane around the Sun, producing seasons. Earth is orbited by one permanent natural satellite, the Moon, which orbits Earth at 384,400 km (1.28 light seconds) and is roughly a quarter as wide as Earth. The Moon's gravity helps stabilize Earth's axis, causes tides, and gradually slows Earth's rotation. Tidal locking has made the Moon always face Earth with the same side. Earth, like most other bodies in the Solar System, formed 4.5 billion years ago from gas and dust in the early Solar System. During the first billion years of Earth's history, the ocean formed and then life developed within it. Life spread globally and has been altering Earth's atmosphere and surface, leading to the Great Oxidation Event two billion years ago. Humans emerged 300,000 years ago in Africa and have spread across every continent on Earth. Humans depend on Earth's biosphere and natural resources for their survival, but have increasingly impacted the planet's environment. Humanity's current impact on Earth's climate and biosphere is unsustainable, threatening the livelihood of humans and many other forms of life, and causing widespread extinctions.",
      "orbitalSpeed": 29.78,
      "timeToOrbit": 365.25,
      "volume": 1.08321E+12,
      "mass": 5.972E+24,
      "circumference": 40075,
      "escapeVelocity": 11.19,
      "surfaceTemperature": {
        "average": 15
      },
      "surfacePressure": 101.3
    },
    {
      "name": "Mars",
      "gltfModel": "/3d-models/mars/scene.gltf",
      "thumbnail": "/3d-models/mars/textures/Material.001_baseColor.jpeg",
      "radius": 3389.5,
      "closestStar": {
        "name": "Sun",
        "proximity": 227.9
      },
      "prominentElements": [
        {
          "element": "Carbon Dioxide",
          "percentage": 95.3
        },
        {
          "element": "Nitrogen",
          "percentage": 2.7
        },
        {
          "element": "Argon",
          "percentage": 1.6
        }
      ],
      "habitabilityScore": 3.5,
      "smallDescription": "The Red Planet with potential for past life.",
      "largeDescription": "Mars is the fourth planet from the Sun. The surface of Mars is orange-red because it is covered in iron(III) oxide dust, giving it the nickname 'the Red Planet.' Mars is among the brightest objects in Earth's sky, and its high-contrast albedo features have made it a common subject for telescope viewing. It is classified as a terrestrial planet and is the second smallest of the Solar System's planets with a diameter of 6,779 km (4,212 mi). In terms of orbital motion, a Martian solar day (sol) is equal to 24.6 hours, and a Martian solar year is equal to 1.88 Earth years (687 Earth days). Mars has two natural satellites that are small and irregular in shape: Phobos and Deimos. The relatively flat plains in northern parts of Mars strongly contrast with the cratered terrain in southern highlands – this terrain observation is known as the Martian dichotomy. Mars hosts many enormous extinct volcanoes (the tallest is Olympus Mons, 21.9 km or 13.6 mi tall) and one of the largest canyons in the Solar System (Valles Marineris, 4,000 km or 2,500 mi long). Geologically, the planet is fairly active with marsquakes trembling underneath the ground, dust devils sweeping across the landscape, and cirrus clouds. Carbon dioxide is substantially present in Mars's polar ice caps and thin atmosphere. During a year, there are large surface temperature swings on the surface between −78.5 °C (−109.3 °F) to 5.7 °C (42.3 °F), similar to Earth's seasons, as both planets have significant axial tilt. Mars was formed approximately 4.5 billion years ago. During the Noachian period (4.5 to 3.5 billion years ago), Mars's surface was marked by meteor impacts, valley formation, erosion, and the possible presence of water oceans. The Hesperian period (3.5 to 3.3–2.9 billion years ago) was dominated by widespread volcanic activity and flooding that carved immense outflow channels. The Amazonian period, which continues to the present, has been marked by the wind as a dominant influence on geological processes. Due to Mars's geological history, the possibility of past or present life on Mars remains of great scientific interest. Since the late 20th century, Mars has been explored by uncrewed spacecraft and rovers, with the first flyby by the Mariner 4 probe in 1965, the first orbit by the Mars 2 probe in 1971, and the first landing by the Viking 1 probe in 1976. As of 2023, there are at least 11 active probes orbiting Mars or on the Martian surface. Mars is an attractive target for future human exploration missions, though in the 2020s no such mission is planned.",
      "orbitalSpeed": 24.07,
      "timeToOrbit": 687,
      "volume": 1.6318E+11,
      "mass": 6.417E+23,
      "circumference": 21344,
      "escapeVelocity": 5.03,
      "surfaceTemperature": {
        "min": -125,
        "max": 20,
        "average": -60
      },
      "surfacePressure": 6.36
    },
    {
      "name": "Jupiter",
      "gltfModel": "/3d-models/jupiter/scene.gltf",
      "thumbnail": "/3d-models/jupiter/textures/Material_baseColor.jpeg",
      "radius": 69911,
      "closestStar": {
        "name": "Sun",
        "proximity": 778.3
      },
      "prominentElements": [
        {
          "element": "Hydrogen",
          "percentage": 89.8
        },
        {
          "element": "Helium",
          "percentage": 10.2
        },
        {
          "element": "Methane",
          "percentage": 0.3
        }
      ],
      "habitabilityScore": 0,
      "smallDescription": "The largest planet in the solar system.",
      "largeDescription": "Jupiter is the fifth planet from the Sun and the largest in the Solar System. It is a gas giant with a mass more than 2.5 times that of all the other planets in the Solar System combined and slightly less than one-thousandth the mass of the Sun. Its diameter is eleven times that of Earth, and a tenth that of the Sun. Jupiter orbits the Sun at a distance of 5.20 AU (778.5 Gm), with an orbital period of 11.86 years. It is the third brightest natural object in the Earth's night sky, after the Moon and Venus, and has been observed since prehistoric times. Its name derives from that of Jupiter, the chief deity of ancient Roman religion. Jupiter was the first of the Sun's planets to form, and its inward migration during the primordial phase of the Solar System affected much of the formation history of the other planets. Jupiter's atmosphere consists of 76% hydrogen and 24% helium by mass, with a denser interior. It contains trace elements and compounds like carbon, oxygen, sulfur, neon, ammonia, water vapour, phosphine, hydrogen sulfide, and hydrocarbons. Jupiter's helium abundance is 80% of the Sun's, similar to Saturn's composition. The ongoing contraction of Jupiter's interior generates more heat than the planet receives from the Sun. Its internal structure is believed to consist of an outer mantle of fluid metallic hydrogen and a diffuse inner core of denser material. Because of its rapid rate of rotation, one turn in ten hours, Jupiter is an oblate spheroid; it has a slight but noticeable bulge around the equator. The outer atmosphere is divided into a series of latitudinal bands, with turbulence and storms along their interacting boundaries; the most obvious result of this is the Great Red Spot, a giant storm that has been recorded since 1831. Jupiter's magnetic field is the strongest and second-largest contiguous structure in the Solar System, generated by eddy currents within the fluid, metallic hydrogen core. The solar wind interacts with the magnetosphere, extending it outward and affecting Jupiter's orbit. Jupiter is surrounded by a faint system of planetary rings that were discovered in 1979 by Voyager 1 and further investigated by the Galileo orbiter in the 1990s. The Jovian ring system consists mainly of dust and has three main segments: an inner torus of particles known as the halo, a relatively bright main ring, and an outer gossamer ring. The rings have a reddish colour in visible and near-infrared light. The age of the ring system is unknown, possibly dating back to Jupiter's formation. At least 95 moons orbit the planet; the four largest moons—Io, Europa, Ganymede, and Callisto—orbit within the magnetosphere, and were discovered by Galileo Galilei in 1610. Ganymede, the largest of the four, is larger than the planet Mercury. Since 1973, Jupiter has been visited by nine robotic probes: seven flybys and two dedicated orbiters, with two more en route.",
      "orbitalSpeed": 13.07,
      "timeToOrbit": 4331.6,
      "volume": 1.43128E+15,
      "mass": 1.898E+27,
      "circumference": 439264,
      "escapeVelocity": 59.5,
      "surfaceTemperature": {
        "average": -108
      },
      "surfacePressure": "High"
    },
    {
      "name": "Saturn",
      "gltfModel": "/3d-models/saturn/scene.gltf",
      "thumbnail": "/3d-models/saturn/textures/Material.002_baseColor.jpeg",
      "radius": 58232,
      "closestStar": {
        "name": "Sun",
        "proximity": 1427
      },
      "prominentElements": [
        {
          "element": "Hydrogen",
          "percentage": 96.3
        },
        {
          "element": "Helium",
          "percentage": 3.2
        },
        {
          "element": "Methane",
          "percentage": 0.45
        }
      ],
      "habitabilityScore": 0,
      "smallDescription": "Known for its stunning ring system.",
      "largeDescription": "Saturn is the sixth planet from the Sun and the second largest in the Solar System, after Jupiter. It is a gas giant, with an average radius of about nine times that of Earth. It has an eighth the average density of Earth, but is over 95 times more massive. Even though Saturn is almost as big as Jupiter, Saturn has less than a third the mass of Jupiter. Saturn orbits the Sun at a distance of 9.59 AU (1,434 million km), with an orbital period of 29.45 years. Saturn's interior is thought to be composed of a rocky core, surrounded by a deep layer of metallic hydrogen, an intermediate layer of liquid hydrogen and liquid helium, and an outer layer of gas. Saturn has a pale yellow hue, due to ammonia crystals in its upper atmosphere. An electrical current in the metallic hydrogen layer is thought to give rise to Saturn's planetary magnetic field, which is weaker than Earth's, but has a magnetic moment 580 times that of Earth because of Saturn's greater size. Saturn's magnetic field strength is about a twentieth that of Jupiter. The outer atmosphere is generally bland and lacking in contrast, although long-lived features can appear. Wind speeds on Saturn can reach 1,800 kilometres per hour (1,100 miles per hour). The planet has a bright and extensive system of rings, composed mainly of ice particles, with a smaller amount of rocky debris and dust. At least 146 moons orbit the planet, of which 63 are officially named; these do not include the hundreds of moonlets in the rings. Titan, Saturn's largest moon and the second largest in the Solar System, is larger (and less massive) than the planet Mercury and is the only moon in the Solar System that has a substantial atmosphere.",
      "orbitalSpeed": 9.69,
      "timeToOrbit": 10759,
      "volume": 8.2713E+14,
      "mass": 5.683E+26,
      "circumference": 365882,
      "escapeVelocity": 35.5,
      "surfaceTemperature": {
        "average": -139
      },
      "surfacePressure": "High"
    },
    {
      "name": "Uranus",
      "gltfModel": "/3d-models/uranus/scene.gltf",
      "thumbnail": "/3d-models/uranus/textures/Material.002_baseColor.jpeg",
      "radius": 25362,
      "closestStar": {
        "name": "Sun",
        "proximity": 2871
      },
      "prominentElements": [
        {
          "element": "Hydrogen",
          "percentage": 83
        },
        {
          "element": "Helium",
          "percentage": 15
        },
        {
          "element": "Methane",
          "percentage": 2.3
        }
      ],
      "habitabilityScore": 0,
      "smallDescription": "An ice giant with a unique tilt.",
      "largeDescription": "Uranus is the seventh planet from the Sun and is classified as a gaseous, cyan-coloured ice giant. Most of its composition includes water, ammonia, and methane in a supercritical phase, referred to in astronomy as 'ice' or volatiles. The planet's atmosphere features a complex layered cloud structure and exhibits the lowest minimum temperature in the Solar System at 49 K (−224 °C; −371 °F). Uranus has a pronounced axial tilt of 82.23° and a retrograde rotation period of 17 hours and 14 minutes. This extreme tilt causes its poles to experience 42 years of continuous sunlight followed by 42 years of continuous darkness during its 84-Earth-year orbital period around the Sun. Uranus has the third-largest diameter and fourth-largest mass among the Solar System's planets. Current models suggest that beneath its volatile mantle lies a rocky core, surrounded by a thick atmosphere of hydrogen and helium. Trace hydrocarbons, carbon monoxide, and carbon dioxide—likely originating from comets—have been detected in its upper atmosphere. The planet's atmosphere is marked by various unexplained climate phenomena, including peak wind speeds of 900 km/h (560 mph), variations in its polar cap, and erratic cloud formation. Unlike other giant planets, Uranus emits very low internal heat, the reason for which remains unclear. Uranus has a ring system, a magnetosphere, and numerous natural satellites. The ring system is extremely dark, reflecting only about 2% of incoming light. Uranus's 28 known natural satellites include 18 regular moons, of which 13 are small inner moons. The five major moons—Miranda, Ariel, Umbriel, Titania, and Oberon—lie further out, while ten irregular moons orbit at much greater distances. Uranus's magnetosphere is highly asymmetric and is believed to be responsible for the darkening of its rings and moons due to the presence of many charged particles. Although Uranus is visible to the naked eye, it is dim and was not recognized as a planet until 1781, when William Herschel observed it. About seven decades later, consensus was reached to name the planet after the Greek god Uranus (Ouranos), one of the Greek primordial deities. As of 2024, Uranus has been visited up close only once, when Voyager 2 flew by the planet in 1986. While it can now be resolved and observed by telescopes, there is significant interest in revisiting Uranus. The Planetary Science Decadal Survey prioritized the Uranus Orbiter and Probe mission for 2023–2032, and the CNSA has proposed exploring the planet with a subprobe as part of its Tianwen-4 mission.",
      "orbitalSpeed": 6.81,
      "timeToOrbit": 30687,
      "volume": 6.833E+13,
      "mass": 8.681E+25,
      "circumference": 159354,
      "escapeVelocity": 21.3,
      "surfaceTemperature": {
        "average": -195
      },
      "surfacePressure": "Moderate"
    },
    {
      "name": "Neptune",
      "gltfModel": "/3d-models/neptune/scene.gltf",
      "thumbnail": "/3d-models/neptune/textures/moon_baseColor.jpeg",
      "radius": 24622,
      "closestStar": {
        "name": "Sun",
        "proximity": 4495
      },
      "prominentElements": [
        {
          "element": "Hydrogen",
          "percentage": 80
        },
        {
          "element": "Helium",
          "percentage": 19
        },
        {
          "element": "Methane",
          "percentage": 1.5
        }
      ],
      "habitabilityScore": 0,
      "smallDescription": "The windiest planet in the solar system.",
      "largeDescription": "Neptune is the eighth and farthest known planet from the Sun. It is the fourth-largest planet in the Solar System by diameter, the third-most-massive planet, and the densest giant planet. It is 17 times the mass of Earth. Compared to its fellow ice giant Uranus, Neptune is slightly more massive, but denser and smaller. Being composed primarily of gases and liquids, it has no well-defined solid surface and orbits the Sun once every 164.8 years at an orbital distance of 30.1 astronomical units (4.5 billion kilometres; 2.8 billion miles). It is named after the Roman god of the sea and has the astronomical symbol ♆, representing Neptune's trident. Neptune is not visible to the unaided eye and is the only planet in the Solar System that was discovered based on mathematical predictions derived from indirect observations, rather than being initially observed by direct empirical observation. This occurred when unexpected changes in the orbit of Uranus led Alexis Bouvard to hypothesize that its orbit was subject to gravitational perturbation by an unknown planet. After Bouvard's death, the position of Neptune was independently predicted from his observations by John Couch Adams and Urbain Le Verrier. Neptune was subsequently directly observed with a telescope on 23 September 1846 by Johann Gottfried Galle within a degree of the position predicted by Le Verrier. Its largest moon, Triton, was discovered shortly thereafter, though none of the planet's remaining moons were located telescopically until the 20th century. The planet's distance from Earth gives it a small apparent size, and its distance from the Sun renders it very dim, making it challenging to study with Earth-based telescopes. The advent of the Hubble Space Telescope and large ground-based telescopes with adaptive optics enabled detailed observations. Neptune was visited by Voyager 2, which flew by the planet on 25 August 1989; Voyager 2 remains the only spacecraft to have visited it. Neptune's atmosphere is composed primarily of hydrogen and helium, with traces of hydrocarbons and possibly nitrogen, as well as a higher proportion of ices such as water, ammonia, and methane. Its interior is primarily composed of ices and rock, distinguishing it from the gas giants and categorizing it as an ice giant. Traces of methane in the outermost regions, along with Rayleigh scattering, make Neptune appear faintly blue. Neptune's atmosphere is active, with consistently visible weather patterns, unlike the featureless atmosphere of Uranus. During the Voyager 2 flyby in 1989, the planet's southern hemisphere exhibited a Great Dark Spot comparable to Jupiter's Great Red Spot. In 2018, newer dark spots were observed. Neptune has the strongest sustained winds of any planet in the Solar System, reaching speeds of up to 2,100 km/h (1,300 mph). Its great distance from the Sun results in an extremely cold outer atmosphere, with temperatures at the cloud tops nearing 55 K (−218 °C; −361 °F). Temperatures at its core are approximately 5,400 K (5,100 °C; 9,300 °F). Neptune has a faint and fragmented ring system, referred to as 'arcs,' discovered in 1984 and confirmed by Voyager 2.",
      "orbitalSpeed": 5.43,
      "timeToOrbit": 60190,
      "volume": 6.254E+13,
      "mass": 1.024E+26,
      "circumference": 154704,
      "escapeVelocity": 23.5,
      "surfaceTemperature": {
        "average": -201
      },
      "surfacePressure": "Moderate"
    },
    {
      "name": "Pluto",
      "gltfModel": "/3d-models/pluto/scene.gltf",
      "thumbnail": "/3d-models/pluto/textures/Scene_-_Root_baseColor.jpeg",
      "radius": 1188.3,
      "closestStar": {
        "name": "Sun",
        "proximity": 5906
      },
      "prominentElements": [
        {
          "element": "Nitrogen",
          "percentage": 98
        },
        {
          "element": "Methane",
          "percentage": 1.5
        },
        {
          "element": "Carbon Monoxide",
          "percentage": 0.5
        }
      ],
      "habitabilityScore": 0,
      "smallDescription": "A dwarf planet with a heart-shaped glacier.",
      "largeDescription": "Pluto, designated as 134340 Pluto, is a dwarf planet located in the Kuiper belt, a region of icy bodies beyond Neptune's orbit. It is the ninth-largest and tenth-most-massive known object to directly orbit the Sun. By volume, Pluto is the largest known trans-Neptunian object, though it is less massive than Eris. Composed primarily of ice and rock, Pluto is much smaller than the inner planets, possessing about one-sixth the mass of Earth's Moon and one-third its volume. Pluto follows a moderately eccentric and inclined orbit, ranging from 30 to 49 astronomical units (AU) from the Sun, equivalent to 4.5 to 7.3 billion kilometers. At an average orbital distance of 39.5 AU (5.91 billion kilometers), sunlight takes approximately 5.5 hours to reach Pluto. Despite its eccentric orbit occasionally bringing it closer to the Sun than Neptune, a stable orbital resonance prevents any collisions between the two bodies. Pluto has five known moons: Charon, the largest, with a diameter just over half that of Pluto; and smaller satellites Styx, Nix, Kerberos, and Hydra. The Pluto-Charon system is sometimes regarded as a binary system because their barycenter lies outside either body, and both are tidally locked to one another. Pluto was first observed in 1930 by Clyde W. Tombaugh, becoming the first discovered Kuiper belt object. Initially celebrated as the ninth planet, its planetary status came under scrutiny after the discovery of other Kuiper belt objects in the 1990s and the more massive scattered disk object Eris in 2005. These discoveries led the International Astronomical Union (IAU) to reclassify Pluto as a dwarf planet in 2006. Nevertheless, many planetary astronomers continue to consider Pluto and similar objects as planets. New Horizons became the first spacecraft to visit Pluto, performing a flyby on July 14, 2015, and providing detailed observations of Pluto and its moons.",
      "orbitalSpeed": 4.74,
      "timeToOrbit": 90560,
      "volume": 7.057E+9,
      "mass": 1.309E+22,
      "circumference": 7481,
      "escapeVelocity": 1.3,
      "surfaceTemperature": {
        "average": -229
      },
      "surfacePressure": 0.015
    }
  ]
}